kAMDSuccess = "No hi ha hagut cap error.";
kAMDUndefinedError = "Hi ha hagut un error desconegut.";
kAMDBadHeaderError = "No s’ha pogut transferir l’arxiu.";
kAMDNoResourcesError = "No s’ha pogut assignar un recurs.";
kAMDReadError = "No s’ha pogut llegir el dispositiu.";
kAMDWriteError = "No s’ha pogut escriure al dispositiu.";
kAMDUnknownPacketError = "El paquet és desconegut.";
kAMDInvalidArgumentError = "L’argument no és vàlid.";
kAMDNotFoundError = "No s’ha trobat l’arxiu.";
kAMDIsDirectoryError = "La ruta és un directori.";
kAMDPermissionError = "No disposeu de permís.";
kAMDNotConnectedError = "No hi ha connexió amb el dispositiu.";
kAMDTimeOutError = "S’ha esgotat el temps d’espera de l’operació.";
kAMDOverrunError = "Excés de dades en la memòria intermèdia.";
kAMDEOFError = "Final d’arxiu.";
kAMDUnsupportedError = "Operació no acceptada.";
kAMDFileExistsError = "L’arxiu ja existeix.";
kAMDBusyError = "El dispositiu està ocupat.";
kAMDCryptoError = "No s’ha pogut establir una connexió segura amb el dispositiu.";
kAMDTooBigError = "El missatge és massa gran.";
kAMDInvalidResponseError = "S’ha rebut una resposta inesperada del dispositiu.";
kAMDMissingKeyError = "Falta la clau.";
kAMDMissingValueError = "Falta el valor.";
kAMDGetProhibitedError = "No es pot obtenir el valor del dispositiu bloquejat amb codi.";
kAMDSetProhibitedError = "No es pot definir el valor per al dispositiu.";
kAMDRemoveProhibitedError = "No es pot eliminar el valor del dispositiu.";
kAMDImmutableValueError = "Aquest valor no es pot modificar.";
kAMDPasswordProtectedError = "El dispositiu està protegit amb codi.";
kAMDMissingHostIDError = "El dispositiu no reconeix aquest servidor.";
kAMDInvalidHostIDError = "El dispositiu no reconeix aquest servidor.";
kAMDSessionActiveError = "La sessió està activa.";
kAMDSessionInactiveError = "La sessió està inactiva.";
kAMDMissingSessionIDError = "Falta l’ID de la sessió.";
kAMDInvalidSessionIDError = "L’ID de sessió no és vàlid.";
kAMDMissingServiceError = "Falta el servei.";
kAMDInvalidServiceError = "El servei no és vàlid.";
kAMDServiceLimitError = "S’estan executant massa exemplars d’aquest servei.";
kAMDCheckinSetupFailedError = "No s’ha pogut iniciar el servei en el dispositiu";
kAMDInvalidCheckinError = "No s’ha pogut iniciar el servei en el dispositiu";
kAMDCheckinTimeoutError = "El servei no s’ha iniciat correctament en el dispositiu.";
kAMDCheckinConnectionFailedError = "El servei no s’ha iniciat correctament en el dispositiu.";
kAMDCheckinReceiveFailedError = "El servei no s’ha iniciat correctament en el dispositiu.";
kAMDCheckinResponseFailedError = "El servei no s’ha iniciat correctament en el dispositiu.";
kAMDCheckinOutOfMemoryError = "El servei no s’ha iniciat correctament en el dispositiu.";
kAMDCheckinSendFailedError = "El servei no s’ha iniciat correctament en el dispositiu.";
kAMDMissingPairRecordError = "El servidor no està enllaçat al dispositiu.";
kAMDInvalidPairRecordError = "El servidor ja no està enllaçat amb el dispositiu.";
kAMDSavePairRecordFailedError = "No s’ha pogut desar el registre d’enllaços.";
kAMDInvalidActivationRecordError = "El registre d’activació no és vàlid.";
kAMDMissingActivationRecordError = "No s’ha trobat el registre d’activació.";
kAMDServiceProhibitedError = "No s’ha pogut iniciar el servei en el dispositiu.";
kAMDEscrowLockedError = "El dispositiu no estarà disponible fins a desbloquejar-lo per primer cop després de la inicialització.";
kAMDProhibitedBySupervision = "Aquesta operació està prohibida als dispositius supervisats.";
kAMDPairingProhibitedError = "Els enllaços només es poden fer via USB.";
kAMDWrongDroidError = "El dispositiu està en mode de recuperació.";
kAMDSUVerificationError = "No s’ha pogut verificar el paquet d’actualització de programari.";
kAMDSUPatchError = "No s’ha pogut corregir l’arxiu.";
kAMDSUFirmwareError = "No s’ha pogut actualitzar el firmware.";
kAMDProvisioningProfileNotValid = "El perfil de dades no és vàlid.";
kAMDSendMessageError = "No s’ha pogut enviar un missatge al dispositiu.";
kAMDReceiveMessageError = "No s’ha pogut rebre un missatge del dispositiu.";
kAMDMissingOptionsError = "Falten les opcions.";
kAMDMissingImageTypeError = "Falta la imatge.";
kAMDDigestFailedError = "No s’ha pogut llegir la imatge de disc.";
kAMDStartServiceError = "No s’ha pogut iniciar el servei.";
kAMDInvalidDiskImageError = "La imatge de disc no és vàlida.";
kAMDMissingDigestError = "Falta el processament.";
kAMDMuxError = "Hi ha hagut un error amb el multiplexor del dispositiu USB.";
kAMDApplicationAlreadyInstalledError = "Ja hi ha instal·lada al dispositiu una aplicació del sistema amb l'identificador del paquet especificat que no es pot reemplaçar.";
kAMDApplicationMoveFailedError = "No s’ha pogut traslladar l’aplicació al seu lloc en el dispositiu.";
//kAMDApplicationSINFCaptureFailedError = "";
kAMDApplicationSandboxFailedError = "No s’han pogut aïllar els processos de l’aplicació.";
kAMDApplicationVerificationFailedError = "No s’ha pogut verificar l’aplicació.";
kAMDArchiveDestructionFailedError = "No s’ha pogut eliminar l’arxiu comprimit de l’aplicació.";
kAMDBundleVerificationFailedError = "No s’ha pogut verificar el paquet de l’operador.";
kAMDCarrierBundleCopyFailedError = "No s’ha pogut instal·lar el paquet de l’operador.";
kAMDCarrierBundleDirectoryCreationFailedError = "No s’ha pogut crear el directori del paquet de l’operador.";
kAMDCarrierBundleMissingSupportedSIMsError = "No hi ha cap SIM compatible per a aquest paquet de l’operador.";
kAMDCommCenterNotificationFailedError = "No s’ha pogut rebre cap notificació de la banda de base.";
kAMDContainerCreationFailedError = "No s’ha pogut crear el contenidor de l’aplicació.";
kAMDContainerP0wnFailedError = "No s’han pogut reparar els permisos del contenidor de l’aplicació.";
kAMDContainerRemovalFailedError = "No s’ha pogut eliminar el contenidor de l’aplicació.";
kAMDEmbeddedProfileInstallFailedError = "No s’ha pogut instal·lar el perfil de dades incorporat.";
kAMDErrorError = "Hi ha hagut un error.";
kAMDExecutableTwiddleFailedError = "No s’han pogut canviar els permisos d’execució de l’aplicació.";
kAMDExistenceCheckFailedError = "No s’ha pogut comprovar si l’aplicació ja existeix.";
kAMDInstallMapUpdateFailedError = "No s’ha pogut actualitzar la llista d’aplicacions instal·lades.";
kAMDManifestCaptureFailedError = "No s’ha pogut desar el manifest de l’aplicació.";
kAMDMapGenerationFailedError = "No s’ha pogut generar el mapa.";
kAMDMissingBundleExecutableError = "El paquet de l’aplicació no conté cap executable.";
kAMDMissingBundleIdentifierError = "El paquet de l’aplicació no conté cap identificador vàlid.";
kAMDMissingBundlePathError = "No s’ha pogut determinar la ruta del paquet de l’aplicació.";
kAMDMissingContainerError = "No s’ha trobat el contenidor de l’aplicació instal·lada.";
kAMDNotificationFailedError = "No s’ha pogut enviar una notificació.";
kAMDPackageExtractionFailedError = "No s’ha pogut obrir el paquet de l’aplicació.";
kAMDPackageInspectionFailedError = "No s’ha pogut inspeccionar el paquet de l’aplicació.";
kAMDPackageMoveFailedError = "No s’ha pogut traslladar el paquet de l’aplicació a la ubicació temporal.";
kAMDPathConversionFailedError = "No s’ha pogut convertir la ruta.";
kAMDRestoreContainerFailedError = "No s’ha pogut restaurar el contenidor de l’aplicació.";
kAMDSeatbeltProfileRemovalFailedError = "No s’ha pogut eliminar el perfil Seatbelt de l’aplicació.";
kAMDStageCreationFailedError = "No s’ha pogut crear el directori temporal.";
kAMDSymlinkFailedError = "No s’ha pogut crear l’enllaç simbòlic.";
kAMDiTunesArtworkCaptureFailedError = "No s’ha pogut desar la il·lustració de l’iTunes.";
kAMDiTunesMetadataCaptureFailedError = "No s’han pogut desar les metadades de l’iTunes.";
kAMDAlreadyArchivedError = "Aquesta aplicació ja s’ha comprimit.";
kAMDUnknownCommandError = "El dispositiu no reconeix l’ordre.";
kAMDAPIInternalError = "Hi ha hagut un error intern d’API.";
kAMDMuxCreateListenerError = "No s’ha pogut detectar cap dispositiu USB.";
kAMDMuxGetListenerError = "No s’ha pogut detectar el receptor USB.";
kAMDMuxConnectError = "No s’ha pogut connectar al dispositiu.";
kAMDDeviceTooNewError = "Aquesta aplicació s’ha d’actualitzar.";
kAMDDeviceRefNoGood = "Aquest dispositiu ja no està connectat.";
kAMDDeviceDisconnectedError = "Aquest dispositiu ja no està connectat.";
kAMDCannotTranslateError = "No s’han pogut traduir els missatges del dispositiu";
kAMDMobileImageMounterMissingImageSignature = "Desenvolupament no acceptat.";
kAMDMobileImageMounterResponseCreationFailed = "Desenvolupament no acceptat.";
kAMDMobileImageMounterMissingImageType = "Desenvolupament no acceptat.";
kAMDMobileImageMounterMissingImagePath = "Desenvolupament no acceptat.";
kAMDMobileImageMounterImageMapLoadFailed = "Desenvolupament no acceptat.";
kAMDMobileImageMounterAlreadyMounted = "Desenvolupament no acceptat.";
kAMDMobileImageMounterImageMoveFailed = "Desenvolupament no acceptat.";
kAMDMobileImageMounterMountPathMissing = "Desenvolupament no acceptat.";
kAMDMobileImageMounterMountPathNotEmpty = "Desenvolupament no acceptat.";
kAMDMobileImageMounterImageMountFailed = "Desenvolupament no acceptat.";
kAMDMobileImageMounterTrustCacheLoadFailed = "Desenvolupament no acceptat.";
kAMDMobileImageMounterDigestFailed = "Desenvolupament no acceptat.";
kAMDMobileImageMounterDigestCreationFailed = "Desenvolupament no acceptat.";
kAMDMobileImageMounterImageVerificationFailed = "Desenvolupament no acceptat.";
kAMDMobileImageMounterImageInfoCreationFailed = "Desenvolupament no acceptat.";
kAMDMobileImageMounterImageMapStoreFailed = "Desenvolupament no acceptat.";
kAMDDeviceOSVersionTooLow = "La versió del SO del dispositiu és massa antiga.";
kAMDNoWifiSyncSupportError = "Aquest dispositiu no permet la sincronització sense fils.";
kAMDDeviceFamilyNotSupported = "L’aplicació és incompatible amb aquest tipus de dispositiu.";
kAMDPackagePatchFailedError = "No s’ha pogut corregir l’aplicació amb l’actualització.";
kAMDIncorrectArchitectureError = "L’aplicació és incompatible amb el tipus de CPU del dispositiu.";
kAMDPluginCopyFailedError = "No s’ha pogut copiar el complement de la VPN al contenidor d’aplicacions";
kAMDBreadcrumbFailedError = "No s’ha pogut escriure el rastreig de la instal·lació.";
kAMDBreadcrumbUnlockError = "No s’ha pogut actualitzar el rastreig de la instal·lació.";
kAMDGeoJSONCaptureFailedError = "No s’han pogut desar les dades de GeoJSON.";
kAMDNewsstandArtworkCaptureFailedError = "No s’ha pogut desar la il·lustració del Quiosc.";
kAMDMissingCommandError = "La sol·licitud no contenia cap ordre.";
kAMDNotEntitledError = "L’aplicació no està autoritzada a fer aquesta sol·licitud.";
kAMDMissingPackagePathError = "Falta la ruta del paquet a la sol·licitud.";
kAMDMissingContainerPathError = "Falta la ruta del contenidor a la sol·licitud.";
kAMDMissingApplicationIdentifierError = "Falta l’identificador de l’aplicació a la sol·licitud.";
kAMDMissingAttributeValueError = "Falta un valor obligatori a la sol·licitud.";
kAMDLookupFailedError = "No s’han pogut llistar les aplicacions instal·lades.";
kAMDDictCreationFailedError = "No s’han pogut extreure les característiques de la sol·licitud.";

/* kMISFileError */
"A file operation failed." = "Una operació amb arxius ha fallat.";

/* kMISModifiedResourcesError */
"A signed resource has been added, modified, or deleted." = "S’ha afegit, modificat o eliminat un recurs firmat.";

/* kMISInvalidSignerError */
"A valid provisioning profile for this executable was not found." = "No s’ha trobat cap perfil de dades vàlid per a aquest executable.";

/* kMISUnknownError */
"An unknown error has occurred." = "Hi ha hagut un error desconegut.";

/* kMISNotMutableError */
"Attempted to modify an immutable provisioning profile." = "S’ha intentat canviar un perfil de dades no modificable.";

/* kMISApplicationSignatureNotValidError */
"The application does not have a valid signature." = "L’aplicació no té cap firma vàlida.";

/* kMISApplicationSignatureNotValidError */
"The application's signature is valid but it does not match the expected hash." = "La firma de l’aplicació és vàlida, però no coincideix amb l’identificador esperat.";

/* kMISAdHocSignatureError */
"The executable contains an invalid signature." = "L’executable conté una firma no vàlida.";

/* kMISInvalidEntitlementError */
"The executable was signed with invalid entitlements." = "L’executable estava firmat amb drets no vàlids.";

/* kMISInvalidSignerCertError */
"The identity used to sign the executable is no longer valid." = "La identitat utilitzada per firmar l’executable ja no és vàlida.";

/* kMISSignatureNotValidError */
"The signature was not valid." = "La firma no era vàlida.";

/* kMISConnectionClosedError */
"There was an error communicating with your device." = "Hi ha hagut un error de comunicació amb el dispositiu.";

/* kMISUnsupportedDeviceError */
"This provisioning profile cannot be installed on this device." = "Aquest perfil de dades no es pot instal·lar en aquest dispositiu.";

/* kMISProfileSignatureNotValidError */
"This provisioning profile does not have a valid signature (or it has a valid, but untrusted signature)." = "Aquest perfil de dades no té cap firma vàlida (o en té una de no fiable).";

/* kMISExpiredError */
"This provisioning profile has expired." = "Aquest perfil de dades ha caducat.";

/* kMISMalformedProfileError */
"This provisioning profile is malformed." = "El perfil de dades està mal format.";

/* kMISUnsupportedVersionError */
"This provisioning profile is unsupported." = "Aquest perfil de dades no és compatible.";

/* kMISAllocationError */
"Unable to allocate memory." = "No s’ha pogut assignar memòria.";

